; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob76) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate6)
	(at pallet2 depot2)
	(clear crate11)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate1)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot2)
	(clear crate10)
	(at pallet7 depot2)
	(clear crate3)
	(at pallet8 distributor1)
	(clear pallet8)
	(at truck0 distributor2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 373)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 258)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot1)
	(available hoist7)
	(at crate0 depot2)
	(on crate0 pallet6)
	(= (weight crate0) 39)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(= (weight crate1) 66)
	(at crate2 depot2)
	(on crate2 pallet7)
	(= (weight crate2) 6)
	(at crate3 depot2)
	(on crate3 crate2)
	(= (weight crate3) 95)
	(at crate4 depot2)
	(on crate4 crate0)
	(= (weight crate4) 90)
	(at crate5 depot2)
	(on crate5 crate4)
	(= (weight crate5) 95)
	(at crate6 depot1)
	(on crate6 pallet1)
	(= (weight crate6) 94)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(= (weight crate7) 80)
	(at crate8 depot2)
	(on crate8 crate5)
	(= (weight crate8) 57)
	(at crate9 depot2)
	(on crate9 pallet2)
	(= (weight crate9) 49)
	(at crate10 depot2)
	(on crate10 crate8)
	(= (weight crate10) 2)
	(at crate11 depot2)
	(on crate11 crate9)
	(= (weight crate11) 79)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate8)
		(on crate3 pallet4)
		(on crate4 crate9)
		(on crate5 pallet8)
		(on crate7 pallet0)
		(on crate8 pallet3)
		(on crate9 pallet7)
		(on crate10 pallet2)
		(on crate11 pallet5)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist6 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist6) (on crate7 pallet5)
   added: (lifting hoist6 crate7) (clear pallet5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 9
2. (load hoist6 crate7 truck0 distributor2)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   changed: (current_load truck0) from 0 to 80
   goals met: 0 of 9
3. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 9
4. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 80 to 0
   goals met: 0 of 9
5. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 11 to 21
   goals met: 0 of 9
6. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 1 of 9
7. (lift hoist2 crate3 crate2 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 21 to 22
   goals met: 1 of 9
8. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 9
9. (load hoist2 crate3 truck0 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 95
   goals met: 1 of 9
10. (lift hoist2 crate11 crate9 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 crate9)
   added: (lifting hoist2 crate11) (clear crate9)
   changed: (fuel-cost) from 32 to 33
   goals met: 1 of 9
11. (load hoist2 crate11 truck0 depot2)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   changed: (current_load truck0) from 95 to 174
   goals met: 1 of 9
12. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 9
13. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   changed: (current_load truck0) from 174 to 95
   goals met: 1 of 9
14. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 43 to 53
   goals met: 1 of 9
15. (drop hoist5 crate11 pallet5 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet5)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet5)
   goals met: 2 of 9
16. (lift hoist2 crate2 pallet7 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet7)
   added: (lifting hoist2 crate2) (clear pallet7)
   changed: (fuel-cost) from 53 to 54
   goals met: 2 of 9
17. (load hoist2 crate2 truck0 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 95 to 101
   goals met: 2 of 9
18. (lift hoist2 crate9 pallet2 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 pallet2)
   added: (lifting hoist2 crate9) (clear pallet2)
   changed: (fuel-cost) from 54 to 55
   goals met: 2 of 9
19. (drop hoist2 crate9 pallet7 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet7)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet7)
   goals met: 3 of 9
20. (lift hoist2 crate10 crate8 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 crate8)
   added: (lifting hoist2 crate10) (clear crate8)
   changed: (fuel-cost) from 55 to 56
   goals met: 3 of 9
21. (drop hoist2 crate10 pallet2 depot2)
   deleted: (lifting hoist2 crate10) (clear pallet2)
   added: (available hoist2) (at crate10 depot2) (clear crate10) (on crate10 pallet2)
   goals met: 4 of 9
22. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   changed: (fuel-cost) from 56 to 57
   goals met: 4 of 9
23. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 57 to 67
   goals met: 4 of 9
24. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   changed: (current_load truck0) from 101 to 167
   goals met: 4 of 9
25. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   changed: (current_load truck0) from 167 to 72
   goals met: 4 of 9
26. (drop hoist4 crate3 pallet4 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet4)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 5 of 9
27. (lift hoist2 crate8 crate5 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate5)
   added: (lifting hoist2 crate8) (clear crate5)
   changed: (fuel-cost) from 67 to 68
   goals met: 5 of 9
28. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 68 to 78
   goals met: 5 of 9
29. (load hoist2 crate8 truck0 depot2)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 72 to 129
   goals met: 5 of 9
30. (lift hoist2 crate5 crate4 depot2)
   deleted: (at crate5 depot2) (clear crate5) (available hoist2) (on crate5 crate4)
   added: (lifting hoist2 crate5) (clear crate4)
   changed: (fuel-cost) from 78 to 79
   goals met: 5 of 9
31. (load hoist2 crate5 truck0 depot2)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 129 to 224
   goals met: 5 of 9
32. (unload hoist2 crate8 truck0 depot2)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 224 to 167
   goals met: 5 of 9
33. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 79 to 89
   goals met: 5 of 9
34. (unload hoist4 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist4)
   added: (lifting hoist4 crate5)
   changed: (current_load truck0) from 167 to 72
   goals met: 5 of 9
35. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 89 to 99
   goals met: 5 of 9
36. (drop hoist4 crate5 pallet8 distributor1)
   deleted: (lifting hoist4 crate5) (clear pallet8)
   added: (available hoist4) (at crate5 distributor1) (clear crate5) (on crate5 pallet8)
   goals met: 6 of 9
37. (drop hoist2 crate8 crate10 depot2)
   deleted: (lifting hoist2 crate8) (clear crate10)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 crate10)
   goals met: 6 of 9
38. (lift hoist2 crate4 crate0 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate0)
   added: (lifting hoist2 crate4) (clear crate0)
   changed: (fuel-cost) from 99 to 100
   goals met: 6 of 9
39. (drop hoist2 crate4 crate9 depot2)
   deleted: (lifting hoist2 crate4) (clear crate9)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate9)
   goals met: 7 of 9
40. (lift hoist2 crate0 pallet6 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet6)
   added: (lifting hoist2 crate0) (clear pallet6)
   changed: (fuel-cost) from 100 to 101
   goals met: 7 of 9
41. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 72 to 111
   goals met: 7 of 9
42. (lift hoist2 crate8 crate10 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 crate10)
   added: (lifting hoist2 crate8) (clear crate10)
   changed: (fuel-cost) from 101 to 102
   goals met: 7 of 9
43. (load hoist2 crate8 truck0 depot2)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 111 to 168
   goals met: 7 of 9
44. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 102 to 112
   goals met: 7 of 9
45. (unload hoist3 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist3)
   added: (lifting hoist3 crate8)
   changed: (current_load truck0) from 168 to 111
   goals met: 7 of 9
46. (drop hoist3 crate8 pallet3 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet3)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet3)
   goals met: 8 of 9
47. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   changed: (current_load truck0) from 111 to 72
   goals met: 8 of 9
48. (drop hoist3 crate0 crate8 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate8)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate8)
   goals met: 9 of 9
